<html>
<title>Libro Blanco de Seguridad de WordPress</title>
<body>

<h1>Libro Blanco de Seguridad de WordPress</h1>

<img src="//s.w.org/about/images/logos/wordpress-logo-stacked-rgb.png" class="aligncenter" />

<h2>Visi&oacute;n de conjunto</h2>

<p>Este documento es un an&aacute;lisis y y explicaci&oacute;n del desarrollo de software del core de WordPress y susprocesos de seguridad relacionados, al igual que un examen de la seguridad  inherente  construida directamente en el software. Las personas que toman decisi&oacute;n y que evaluan WordPress como un sistema de gesti&oacute;n de contenidos o como un marco de aplicaciones web deber&iacute;an usar este documento en su an&aacute;lisis y toma de decisi&oacute;n, y para los desarrolladores deber&iacute;an referirse al mismo para familiarizarse con los componentes de seguridad y las mejores pr&aacute;cticas de software.</p>

<p>La informaci&oacute;n de este documento est&aacute; actualizada para la &uacute;ltima versi&oacute;n estable del software, WordPress 4.1 en el momento de su publicaci&oacute;n, pero deber&iacute;a  ser considerado relevante tambi&eacute;n para las versiones m&aacute;s recientes del software ya que la compatibilidad con versiones anteriores es un enfoque fuerte en el equipo sw desarrollo de WordPress. Medidas de seguridad espec&iacute;ficas y otros cambios se anotar&aacute;n a medida que se a&nacute;adan al core del software en versiones espec&iacute;ficas. Se recomienda encarecidamente que siempre se ejecute la &uacute;ltima versi&oacute;n estable de WordPress para asegurarse de tener la experiencia m&aacute;s segura posible.</p>
<h2>Sumario Ejecutivo</h2>
<p>WordPress es un sistema de gesti&oacute;n de contenidos din&aacute;mico de fuentes abiertas que se usa para hacer funcionar millones de sitios web, aplicaciones web y blogs. En la actualidad es usado por m&aacute;s del 23% de 10 millones de sitios web en Internet. La usabilidad, extensibilidad y la madurez de la comunidad de desarrollo hace que sea una elecci&oacute;n popular y segura para sitios web de todos los tama&nacute;os.</p>

<p>Desde su concepci&oacute;n de 2003, WordPress ha sufrido continuos cambios para endurecerlo de manera que su core pueda gestionar y mititgar las amenazas de seguridad m&aacute;s comunes, incluyendo la lista del Top 10 identificado por El Proyecto de Seguridad para Aplicaciones Web Abiertas (OWASP) como las vulnerabilidades de seguridad m&aacute;s frecuentes, que se discuten en el presente documento.</p>

<p>El equipo de seguridad de WordPress, en colaboraci&oacute;n con el equipo lider del Core de WordPress y respaldados por la comunidad global de WordPress, trabaja para identificar y resolver incidencias de seguridad en el core de software disponible para la distribuci&oacute;n  e  instalaci&oacute;n en WordPress.org, y tambi&eacute;n para recomendar y documentar las mejores pr&aacute;cticas en seguridad para plugins de terceras partes y para autores de temas de terceros.</p>

<p>Los desarrolladores de sitios web y los administradores deber&iacute;an prestar especial atenci&oacute;n al uso correcto de las APIs del core y la configuraci&oacute;n del servidor que han sido la fuente de vulnerabilidades frecuentes, y tambi&eacute;n deben asegurarse que todos los usuarios emplean claves fuertes para acceder a WordPress.</p>
<h2>Una visi&oacute;n general de WordPress</h2>
<p>WordPress es un sistema de gesti&oacute; de contenidos de fuentes abiertas y gratuito (CMS). Es el CMS m&acute;s extensamente usado en el mundo y funciona en m&acute; del 23% de los 10 millones de sitios web m&aacute;s vistos<sup id="ref1"><a href="#footnote1">1</a></a></sup>, ofreciendo una cuota de mercado estimada del 60% de todos los sitios que usan un CMS.</p>

<p>WordPress est&aacute; bajo la Licencia Publica General (GPLv2 o posterior) que proporciona 4 libertades fundamentales, y que puede considerarse como la "carta de derechos" de WordPress</p>
<ol>
	<li>La libertad de ejecutar el programa, para cualquier prop&oacute;sito.</li>
	<li>La libertad de estudiar como funciona el programa, y cambiarlo para que haga lo que tu deseas.</li>
	<li>La libertad de redistribuirlo.</li>
	<li>La libertad de distribuir copias de tus versiones modificadas a otros.</li>
</ol>
<h3>El equipo lider del core de WordPress</h3>
<p>El proyecto WordPress es una meritocracia, The WordPress project is a meritocracy, dirigido por un equipo lider central, y conducido por su co-creador y desarrollador principal, Matt Mullenweg. El equipo gobierna todos los aspectos del proyecto, incluyendo el desarrollo del core, WordPress.org, y las iniciativas de la comunidad.</p>

<p>El equipo que lidera el Core est&aacute; formado por Matt Mullenweg, 5 desarrolladores lider, y m&aacute;s de una docena de desarrolladores del core con acceso permanente a commit. Estos desarrolladores tienen autoridad final en decisiones t&eacute;cnicas, y conducen las discusiones t&eacute;cnicas y los esfuerzos de implementaci&oacute;n.</p>

<p>WordPress tiene un n&uacute;mero de desarrolladores contribuyendo. Algunos de estos son antiguos o actuales commiters, y algunos son probablemente futuros commiters. Estos desarrolladores que contribuyen son contribuidores veteranos y de confianza de WordPress que se han ganado un gran respeto entre sus homologos. Seg&uacute; necesidades, WordPress tiene committers invitados, que son individuos a los que se concede acceso para commit, en algunas ocasiones para componentes espec&iacute;ficos o con criterios temporales o de prueba.</p>

<p>Los desarrolladores del core y los contribuidores gu&iacute;an de manera principal el desarrollo. En cada versi&oacute;n, cientos de desarrolladores contribuyen al c&oacute;digo de WordPress. Estos contribuidores del core son voluntarios que contribuyen al c&oacute;digo fuente base de alguna manera.</p>
<h3>El ciclo de liberaci&oacute;n de versi&oacute;n de WordPress</h3>
<p>Cada ciclo de liberaci&oacute;n de WordPress es conducido por uno o m&acute; desarrolladores del core de WordPress. Un ciclo de liberaci&oacute;n generalmente dura sobre los 4 meses desde la reuni&oacute;n de alcance inicial hasta el lanzamiento de la versi&oacute;n.</p>

<p>Un ciclo de liberaci&oacute;n sigue el siguiente patr&oacute;n<sup id="ref2"><a href="#footnote2">2</a></sup>:</p>
<ul>
	<li>Fase 1: Planificaci&oacute;n y aseguramiento de la l&iacute; del equipo. Esto se hace en la sala de chat #core en Slack. La liberaci&oacute;n discute caracter&iacute;sticas de la siguiente versi&oacute;n de WordPress. Los contribuidores de WordPress se implican con la mencionada discusi&oacute;n. Las iniciativas de la liberaci&oacute;n identificaran las iniciativas del equipo para cada una de las caracter&iacute;sticas.</li>
	<li>Fase 2: Inicio del desarrollo. Los lideres de equipo montan equipos y trabajan en sus funciones o caracter&iacute;sticas asignadas. Se programan chats periodicos para asegurarse que el desarrollo sigue progresando.</li>
	<li>Fase 3: Beta. Se liberan las Betas, y los a los beta-testers se les pide que empiecen a informar de fallos. No se realizan m&aacute; commits para nuevas mejoras y no se llevan a cabo solicitud de funcionalidades a partir de esta fase. A los autores de terceras partes de plugins y temas se les anima a que prueban su c&oacute;odigo contra los cambios que se est&aacute; realizando.</li>
	<li>Fase 4: Candidato a liberaci&oacute;. Hay una cadena de congelaci&oacute; para cadenas traducibles a partir de este punto. El trabajo se centra en regresiones e incidencias bloquantes solamente.</li>
	<li>Fase 5: Lanzamiento. Se lanza la versi&oacute;n de WordPress y se hace disponible en el administrador de  WordPress para actualizaciones.</li>
</ul>
<h3>Numeraci&oacute;n de Versiony liberaciones de seguridad</h3>
<p>Una versi&oacute; principal de WordPress se dicta por las 2 primeras secuencias. Por ejemplo, 3.5 es una versi&oacute; principal, al igual que 3.6, 3.7, o 4.0. No hay un "WordPress 3" o "WordPress 4" y cada liberaci&ocute;n o versi&oacute;n principal es referida por su numeraci&oacute;n, i.e., "WordPress 3.9."</p>

<p>La liberaciones m&aacute;s importantes pueden a&nacute;adir nuevas caracter&iacute;sticas y APIs de desarrollo. Aunque lo tipico en el mundo del software, una versi&oacute;n "principal" significa que se pueda romper la compatibilidad con versiones precedentes, WordPress se esfuerza en no romper la compatiblidad con versiones previas. La compatibilidad hacia atras es una de las filosof&iacute;as m&aacute;s importante del proyecto, con el objetivo de hacer las actualizaciones m&aacute;s f&aacute;ciles para los usuarios y los desarrolladores por igual.</p>

<p>Una versi&oacute;n menor de WordPress se indica por la tercera secuencia num&eacute;rica. La versi&oacute;n 3.5.1 es una versi&oacute;n menor, al igual que la 3.4.2<sup id="ref3"><a href="#footnote3">3</a></sup>. Una versi&oacute;n menor se reserva para arreglos de vulnerabilidades de seguridad y abordar errores cr&iacute;ticos solamente. Ya que se liberan nuevas versiones de WordPress con frecuencia - el objetivo es que cada 4-5 meses haya una liberaci&oacute;n mayor, y las liberaciones menores se lleven a cabo seg&uacute;n necesidad- hay solamente necesidad de liberaciones mayores y menores.</p>

<h3>Compatibilidad con versiones precedentes</h3>
<p>El proyecto WordPress tiene un fuerte compromiso con la compatibilidad con versiones precedentes. Este compromiso significa que los temas, plugins y el c&oacute;digo personalizado continua funcionando cuando el core de WordPress se actualiza, animando a los propietarios del sitio a mantener las versiones del WordPress actualizadas a la &uacute;ltima versi&oacute;n segura.</p>
<h2>WordPress y la Seguridad</h2>
<h3>El equipo de seguridad de WordPress</h3>
<p>El equipo de seguridad de WordPress est&aacute; formado por aproximadamente 25 expertos incluyendo los desarrolladores principales y los investigadores de seguridad &mdash; aproximadamente la mitad son empleado de Automattic (los creadores de WordPress.com, la plataforma m&aacute;s antigua y grande de alojamiento de WordPress en la web), y el otro conjunto trabajan en el campo de la seguridad web. El equipo consulta con investigadores en seguridad bien conocidos y de confianza y con empresas de alojamiento web.<sup><a href="#footnote3">3</a></sup>.</p>

<p>El equipo de seguridad de WordPress a menudo colabora con otros equipos de seguridad The WordPress Security Team often collaborates with other security teams para abordar incidencias en dependencias comunes, tales como resolver la vulnerabilidad en el int&eacute;rprete de PHP XML, usado por la API de  XML-RPC API que se incluye con WordPress, en WordPress 3.9.2<sup id="ref4"><a href="#footnote4">4</a></sup>. Esta resoluci&oacute;n de la vulnerabilidad fue el resultado de un esfuerzo conjunto entre los equipos de seguridad de WordPress y Drupal.</p>
<h3>Riesgos de seguridad en WordPress,Proceso e Historia</h3>
<p>El equipo de seguridad de WordPress cree en la revelaci&oacute; responsable alertando al equipo de seguridad de manera inmediata ante cualquier vulnerabilidad potencial. Las vulnerabilidades de seguridad potenciales se pueden indicar al equipo de seguridad directamente a trav&eacute;s de la direcci&oacute;n de email: security@wordpress.org<sup id="ref5"><a href="#footnote5">5</a></sup>. El equipo de seguridad se comunica entre si via una lista privada de correo, y trabaja en un entorno seguro y privado con Trac para seguimiento de incidencias, pruebas y arreglos de fallos y problemas de seguridad.</p>

<p>Cada informe de seguridad es reconocido tras su recepci&oacute;n, y el equipo trabaja para verificar la vulnerabilidad y determinar su grado de severidad. Si se confirma, el equipo de seguridad planifica el parche para solventar el problema que puede ser confirmado para la siguiente versi&oacute;n del software de WordPress o que puede ser subido de inmediato como una versi&oacute;n de seguridad, dependiendo de la severidad de la incidencia.</p>

<p>Para una liberaci&oacute;n inmediata de seguridad, se publica un aviso por parte del equipo de seguridad al sitio de noticias de WordPress.org<sup id="ref6"><a href="#footnote6">6</a></sup>anunciando la liberaci&oacute;n y detallando los cambios. Se da cr&eacute;dito para revelaci&oacute;n responsable de una vulnerabilidad en los avisos para animar y reforzar el informe responsable continuado en el futuro.</p>

<p>Los Administradores del software de WordPress ven una notificaci&oacute;n en el panel de su sitio web para actualizar cuando hay una versi&oacuten disponible, y siguiendo el manual de actualizaci&oacute; los usuarios son redirigidos a la pantalla de Acerca de WordPress que detalla los cambios. Si los administradores tienen habilitadas las actualizaciones autom&aacute;ticas en segundo plano, recibir&aacute;n un email despu&eacute;s de que la actualizaci&oacute;n se haya completado.</p>
<h3>Actualizaciones autom&aacute;ticas en segundo plano para versiones de seguridad</h3>
<p>Empezando con la versi&oacute;n 3.7, WordPress introdujo actualizaciones autom&aacute;ticas en segundo plano para todas las versiones menores<sup id="ref7"><a href="#footnote7">7</a></sup>, tales como la 3.7.1 y 3.7.2. El equipo de seguridad de WordPress puede identificar, arreglar, y promover mejoras de seguridad autom&aacute;ticas para WordPress sin que el propietario del sitio necesite hacer algo por su parte, y la actualizaci&oacute;n de seguridad se instalar&aacute; autom&aacute;ticamente.</p>

<p>Cuando una actualizaci&oacute;n de seguridad se propone para la versi&oacute;n estable vigente de WordPress, el equipo principal realizar&aacute; tambi&eacute;n dicha actualizaci&oacute;n de seguridad para todas las versiones que sean capaces de recibir actualizaciones en segundo plano (desde WordPress 3.7), de manera que versiones  m&aacute;s antiguas pero recientes de WordPress reciban estas mejoras de seguridad.</p>

<p>Los propietarios individuales de sitios web pueden optar por quitar la actualizaciones autom&aacute;ticas en segundo plano a trav&eacute;s de un simple cambio de su fichero de configuraci&oacute;n, pero se recomienda mantener est&aacute; funcionalidad de manera vehemente por parte del equipo principal, al igual que ejecutar la versi&oacute;n estable m&aacute;s reciente de WordPress.</p>
<h3>El Top 10 de OWASP 2013</h3>
<p> Proyecto Abierto de Seguridad de Aplicaciones Web(OWASP) es una comunidad online dedicada a la seguridad de aplicaciones web. La lista de los 10 principales de OWASP<sup id="ref8"><a href="#footnote8">8</a></sup> se centra en la identicaci&oacute;n de los riesgos de seguridad m&aacute;s importantes en aplicaciones   para una amplia gama de organizaciones. Los 10 elementos m&aacute;s importantes son seleccionados y priorizados en combinaci&oacute;n con la estimaci&oacute;n consensuada sobre explotabilidad, detectabilidad e impacto.</p>

<p>Las siguientes secciones discuten las APIs, recursos, y politicas que usa WordPress para endurecer el n&uacute;cleo de software y los plugins y temas de terceras partes contra estos riesgos potenciales.</p>
<h4>A1 - Inyecci&oacute;n</h4>
<p>Hay un conjunto de funciones y APIs disponibles en WordPress para ayudar a los desarrolladores en que se aseguren que no se pueda inyectar c&oacute;digo no autorizado, y ayudarles a validar y sanitizar los datos. Las mejores pr&aacute;cticas y documentaci&oacute;n est&aacute;n disponibles<sup id="ref9"><a href="#footnote9">9</a></sup> sobre como usar est&aacute;s APIs para proteger, validar o sanitizar la entrada y salida de datos en HTML, URLs, cabeceras HTTP, y cuando se interacciona con la base de datos o el sistema de ficheros. Los Administradores pueden adem&aacute;s restringir los tipos de fichero que se pueden subir mediante filtros.</p>
<h4>A2 - Rotura de autenticaci&oacute;n y gesti&oacute;n de sesiones.</h4>
<h4>A3 - Secuencias de &oacute;rdenes en sitios cruzados (XSS)</h4>
<p>WordPress proporciona una rang de funciones que pueden ayudar a asegurarse que los datos suministrados por el usuario son seguros<sup id="ref10"><a href="#footnote10">10</a></sup>. Los usuarios de confianza, esto es, los administradores y editores de una instalaci&oacute;n sencilla de WordPress, y los administradores de sitios Multisite, pueden publicar HTML o JavaScript sin filtrar si lo necesitan, tales como dentro de un post o una p&aacute;gina. Los usuarios que no son de confianza y el contenido enviado por los usuarios se filtra, por defecto, para quitar las entidades peligrosas, usando la biblioteca KSES mediante la funci&oacute;n<code>wp_kses</code>.</p>

<h4>A4 - Referencia a objectos directos inseguros</h4>
<p>WordPress a menudo proporciona referencias a objetos directos, tales como identificadores num&eacute;ricos &uacute;nicos de cuentas de usuario o contenido disponible en la URL o campos de formularios. Mientras estos identificadores revelan informaci&oacute;n directa del sistema, el rico sistema de control de acceso y permisos WordPress previene las solicitudes no autorizadas.</p>
<h4>A5 - Mala configuraci&oacute;n de Seguridad</h4>
<p>La mayor parte de operaciones de configuraci&oacute;n de seguridad est&aacute;n limitadas a un solo administrador autorizado. La configuraci&oacute;n por defecto de WordPress es evaluada de manera continuada a nivel del equipo principal, y el equipo principal de WordPress proporciona documentaci&oacute;n y las mejores pr&aacute;cticas para reforzar la seguridad de la configuraci&oacute;n del servidor, que ejecuta un sitio WordPress<sup id="ref11"><a href="#footnote11">11</a></sup>.</p>
<h4>A6 - Revelaci&oacute;n de datos sensibles</h4>
<h4>A7 - Funciones de nivel de control de acceso ausentes</h4>
<p>WordPress comprueba la adecuada autorizaci&oacute;n y permisos en cualquier funci&oacute;n de solicitud de nivel de acceso antes de que la acci&oacute;n se lleve a cabo. El acceso o la visualizaci&oacute;n de URLs administrativas, men&uacute;s, y p&aacute;ginas sin la adecuada autenticaci&oacute;n est&aacute; ligada e integrada con el sistema de autenticaci&oacute;n para prevenir acceso a usuarios no autorizados.</p>
<h4>A8 - Falsificaci&oacute;n de petici&oacute;n en sitios cruzados (CSRF)</h4>
<h4>A9 - Using Components with Known Vulnerabilities</h4>
<p>The WordPress core team closely monitors the few included libraries and frameworks WordPress integrates with for core functionality. In the past the core team has made contributions to several third-party components to make them more secure, such as the update to fix a cross-site vulnerability in TinyMCE in WordPress 3.5.2<sup id="ref14"><a href="#footnote14">14</a></sup>.</p>

<p>If necessary, the core team may decide to fork or replace critical external components, such as when the SWFUpload library was officially replaced by the Plupload in 3.5.2, and a secure fork of SWFUpload was made available by the security team<sup id="ref15"><a href="#footnote15">15</a></sup> for those plugins who continued to use SWFUpload in the short-term.</p>
<h4>A10 - Unvalidated Redirects and Forwards</h4>
<p>WordPress' internal access control and authentication system will protect against attempts to direct users to unwanted destinations or automatic redirects. This functionality is also made available to plugin developers via an API, <code>wp_safe_redirect()</code><sup id="ref16"><a href="#footnote16">16</a></sup>.</p>
<h3>Further Security Risks and Concerns</h3>
<h4>XXE (XML eXternal Entity) processing attacks</h4>
<p>When processing XML, WordPress disables the loading of custom XML entities to prevent both External Entity and Entity Expansion attacks. Beyond PHP's core functionality, WordPress does not provide additional secure XML processing API for plugin authors.</p>
<h4>SSRF (Server Side Request Forgery) Attacks</h4>
<p>HTTP requests issued by WordPress are filtered to prevent access to loopback and private IP addresses. Additionally, access is only allowed to certain standard HTTP ports.</p>
<h2>WordPress Plugin and Theme Security</h2>
<h3>The Default Theme</h3>
<p>WordPress requires a theme to be enabled to render content visible on the frontend. The default theme which ships with core WordPress (currently "Twenty Fifteen") has been vigorously reviewed and tested for security reasons by both the team of theme developers plus the core development team.</p>

<p>The default theme can serve as a starting point for custom theme development, and site developers can create a child theme which includes some customization but falls back on the default theme for most functionality and security. The default theme can be easily removed by an administrator if not needed.</p>

<h3>WordPress.org Theme and Plugin Repositories</h3>

<p>There are approximately 30,000+ plugins and 2,000+ themes listed on the WordPress.org site. These themes and plugins are submitted for inclusion and are manually reviewed by volunteers before making them available on the repository.</p>

<p>Inclusion of plugins and themes in the repository is not a guarantee that they are free from security vulnerabilities. Guidelines are provided for plugin authors to consult prior to submission for inclusion in the repository<sup id="ref17"><a href="#footnote17">17</a></sup>, and extensive documentation about how to do WordPress theme development<sup id="ref18"><a href="#footnote18">18</a></sup> is provided on the WordPress.org site.</p>

<p>Each plugin and theme has the ability to be continually developed by the plugin or theme owner, and any subsequent fixes or feature development can be uploaded to the repository and made available to users with that plugin or theme installed with a description of that change. Site administrators are notified of plugins which need to be updated via their administration dashboard.</p>

<p>When a plugin vulnerability is discovered by the WordPress Security Team, they contact the plugin author and work together to fix and release a secure version of the plugin. If there is a lack of response from the plugin author or if the vulnerability is severe, the plugin/theme is pulled from the public directory, and in some cases, fixed and updated directly by the Security Team.</p>
<h3>The Theme Review Team</h3>
<p>The Theme Review Team is a group of volunteers, led by key and established members of the WordPress community, who review and approve themes submitted to be included in the official WordPress Theme directory. The Theme Review Team maintains the official Theme Review Guidelines<sup id="ref19"><a href="#footnote19">19</a></sup>, the Theme Unit Test Data<sup id="ref20"><a href="#footnote20">20</a></sup>, and the Theme Check Plugin<sup id="ref21"><a href="#footnote21">21</a></sup>, and attempts to engage and educate the WordPress Theme developer community regarding development best practices. Inclusion in the group is moderated by core committers of the WordPress development team.</p>
<h2>The Role of the Hosting Provider in WordPress Security</h2>
<p>WordPress can be installed on a multitude of platforms. Though WordPress core software provides many provisions for operating a secure web application, which were covered in this document, the configuration of the operating system and the underlying web server hosting the software is equally important to keep the WordPress applications secure.</p>
<h3>A Note about WordPress.com and WordPress security</h3>
<p>WordPress.com is the largest WordPress installation in the world, and is owned and managed by Automattic, Inc., which was founded by Matt Mullenweg, the WordPress project co-creator. WordPress.com runs on the core WordPress software, and has its own security processes, risks, and solutions<sup id="ref22"><a href="#footnote22">22</a></sup>. This document refers to security regarding the self-hosted, downloadable open source WordPress software available from WordPress.org and installable on any server in the world.</p>
<h2>Appendix</h2>
<h3>Core WordPress APIs</h3>
<p>The WordPress Core Application Programming Interface (API) is comprised of several individual APIs<sup id="ref23"><a href="#footnote23">23</a></sup>, each one covering the functions involved in, and use of, a given set of functionality. Together, these form the project interface which allows plugins and themes to interact with, alter, and extend WordPress core functionality safely and securely.</p>

<p>While each WordPress API provides best practices and standardized ways to interact with and extend WordPress core software, the following WordPress APIs are the most pertinent to enforcing and hardening WordPress security:</p>

<h3>Database API</h3>

<p>The Database API<sup id="ref24"><a href="#footnote24">24</a></sup>, added in WordPress 0.71, provides the correct method for accessing data as named values which are stored in the database layer.</p>

<h3>Filesystem API</h3>

<p>The Filesystem API<sup id="ref25"><a href="#footnote25">25</a></sup>, added in WordPress 2.6<sup id="ref26"><a href="#footnote26">26</a></sup>, was originally created for WordPress' own automatic updates feature. The Filesystem API abstracts out the functionality needed for reading and writing local files to the filesystem to be done securely, on a variety of host types.</p>

<p>It does this through the <code>WP_Filesystem_Base</code> class, and several subclasses which implement different ways of connecting to the local filesystem, depending on individual host support. Any theme or plugin that needs to write files locally should do so using the WP_Filesystem family of classes.</p>

<h3>HTTP API</h3>

<p>The HTTP API<sup id="ref27"><a href="#footnote27">27</a></sup>, added in WordPress 2.7<sup id="ref28"><a href="#footnote28">28</a></sup> and extended further in WordPress 2.8, standardizes the HTTP requests for WordPress. The API handles cookies, gzip encoding and decoding, chunk decoding (if HTTP 1.1), and various other HTTP protocol implementations. The API standardizes requests, tests each method prior to sending, and, based on your server configuration, uses the appropriate method to make the request.</p>

<h3>Permissions and current user API</h3>

<p>The permissions and current user API<sup id="ref29"><a href="#footnote29">29</a></sup> is a set of functions which will help verify the current user's permissions and authority to perform any task or operation being requested, and can protect further against unauthorized users accessing or performing functions beyond their permitted capabilities.</p>
<h3>White paper content License</h3>
<p>The text in this document (not including the WordPress logo or <a href="http://wordpressfoundation.org/trademark-policy/">trademark</a>) is licensed under <a href="https://creativecommons.org/publicdomain/zero/1.0/">CC0 1.0 Universal (CC0 1.0) Public Domain Dedication</a>. You can copy, modify, distribute and perform the work, even for commercial purposes, all without asking permission.</p>

<p><em>A special thank you to Drupal's </em><a href="http://drupalsecurityreport.org/"><em>security white paper</em></a><em>, which provided some inspiration. </em></p>
<h3>Additional Reading</h3>
<ul>
	<li>WordPress News <a href="https://wordpress.org/news/">https://wordpress.org/news/</a></li>
	<li>WordPress Security releases <a href="https://wordpress.org/news/category/security/">https://wordpress.org/news/category/security/</a></li>
	<li>WordPress Developer Resources <a href="https://developer.wordpress.org/">https://developer.wordpress.org/</a></li>
</ul>

<hr />

<p><em>Authored by </em>Sara Rosso </p>

<p><em>Contributions from</em> Barry Abrahamson, Michael Adams, Jon Cave, Helen Hou-Sand&iacute; , Dion Hulse, Mo Jangda, Paul Maiorana</p>

<p><em>Version 1.0 March 2015</em></p>

<hr />

<h3>Footnotes</h3>
<ul>
	<li id='footnote1'><a href="#ref1">[1]</a> <a href="http://w3techs.com/">http://w3techs.com/</a>, as of March 2015</li>
	<li id='footnote2'><a href="#ref2">[2]</a> <a href="https://make.wordpress.org/core/handbook/how-the-release-cycle-works/">https://make.wordpress.org/core/handbook/how-the-release-cycle-works/</a></li>
	<li id='footnote3'><a href="#ref3">[3]</a> Andrew Nacin, WordPress lead developer, <a href="http://vip.wordpress.com/security">http://vip.wordpress.com/security</a></li>
	<li id='footnote4'><a href="#ref4">[4]</a> <a href="https://wordpress.org/news/2014/08/wordpress-3-9-2/">https://wordpress.org/news/2014/08/wordpress-3-9-2/</a></li>
	<li id='footnote5'><a href="#ref5">[5]</a> <a href="http://codex.wordpress.org/Security_FAQ">http://codex.wordpress.org/Security_FAQ</a></li>
	<li id='footnote6'><a href="#ref6">[6]</a> <a href="https://wordpress.org/news/">https://wordpress.org/news/</a></li>
	<li id='footnote7'><a href="#ref7">[7]</a> <a href="https://wordpress.org/news/2013/10/basie/">https://wordpress.org/news/2013/10/basie/</a></li>
	<li id='footnote8'><a href="#ref8">[8]</a> <a href="https://www.owasp.org/index.php/Top_10_2013-Top_10">https://www.owasp.org/index.php/Top_10_2013-Top_10</a></li>
	<li id='footnote9'><a href="#ref9">[9]</a> <a href="https://developer.wordpress.org/plugins/security/">https://developer.wordpress.org/plugins/security/</a></li>
	<li id='footnote10'><a href="#ref10">[10]</a> <a href="http://codex.wordpress.org/Data_Validation#HTML.2FXML">http://codex.wordpress.org/Data_Validation#HTML.2FXML</a></li>
	<li id='footnote11'><a href="#ref11">[11]</a> <a href="http://codex.wordpress.org/Hardening_WordPress">http://codex.wordpress.org/Hardening_WordPress</a></li>
	<li id='footnote12'><a href="#ref12">[12]</a> <a href="http://www.openwall.com/phpass/">http://www.openwall.com/phpass/</a></li>
	<li id='footnote13'><a href="#ref13">[13]</a> <a href="https://developer.wordpress.org/plugins/security/nonces/">https://developer.wordpress.org/plugins/security/nonces/</a></li>
	<li id='footnote14'><a href="#ref14">[14]</a> <a href="https://wordpress.org/news/2013/06/wordpress-3-5-2/">https://wordpress.org/news/2013/06/wordpress-3-5-2/</a></li>
	<li id='footnote15'><a href="#ref15">[15]</a> <a href="https://make.wordpress.org/core/2013/06/21/secure-swfupload/">https://make.wordpress.org/core/2013/06/21/secure-swfupload/</a></li>
	<li id='footnote16'><a href="#ref16">[16]</a> <a href="https://developer.wordpress.org/reference/functions/wp_safe_redirect/">https://developer.wordpress.org/reference/functions/wp_safe_redirect/</a></li>
	<li id='footnote17'><a href="#ref17">[17]</a> <a href="https://wordpress.org/plugins/about/guidelines/">https://wordpress.org/plugins/about/guidelines/</a></li>
	<li id='footnote18'><a href="#ref18">[18]</a> <a href="https://developer.wordpress.org/themes/getting-started/">https://developer.wordpress.org/themes/getting-started/</a></li>
	<li id='footnote19'><a href="#ref19">[19]</a> <a href="http://codex.wordpress.org/Theme_Review">http://codex.wordpress.org/Theme_Review</a></li>
	<li id='footnote20'><a href="#ref20">[20]</a> <a href="http://codex.wordpress.org/Theme_Unit_Test">http://codex.wordpress.org/Theme_Unit_Test</a></li>
	<li id='footnote21'><a href="#ref21">[21]</a> <a href="https://wordpress.org/plugins/theme-check/">https://wordpress.org/plugins/theme-check/</a></li>
	<li id='footnote22'><a href="#ref22">[22]</a> <a href="http://automattic.com/security/">http://automattic.com/security/</a></li>
	<li id='footnote23'><a href="#ref23">[23]</a> <a href="https://codex.wordpress.org/WordPress_APIs">https://codex.wordpress.org/WordPress_APIs</a></li>
	<li id='footnote24'><a href="#ref24">[24]</a> <a href="https://codex.wordpress.org/Database_API">https://codex.wordpress.org/Database_API</a></li>
	<li id='footnote25'><a href="#ref25">[25]</a> <a href="https://codex.wordpress.org/Filesystem_API">https://codex.wordpress.org/Filesystem_API</a></li>
	<li id='footnote26'><a href="#ref26">[26]</a> <a href="http://codex.wordpress.org/Version_2.6">http://codex.wordpress.org/Version_2.6</a></li>
	<li id='footnote27'><a href="#ref27">[27]</a> <a href="https://codex.wordpress.org/HTTP_API">https://codex.wordpress.org/HTTP_API</a></li>
	<li id='footnote28'><a href="#ref28">[28]</a> <a href="https://codex.wordpress.org/Version_2.7">https://codex.wordpress.org/Version_2.7</a></li>
	<li id='footnote29'><a href="#ref29">[29]</a> <a href="http://codex.wordpress.org/Function_Reference/current_user_can">http://codex.wordpress.org/Function_Reference/current_user_can</a></li>
</ul>

</body></html>
